una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9xe512.h
/* -------- SPI_CR : (SPI Offset: 0x0) SPI Control Register -------- */
#define AT91C_SPI_SPIEN       ((unsigned int) 0x1 <<  0) /* (SPI) SPI Enable*/
#define AT91C_SPI_SPIDIS      ((unsigned int) 0x1 <<  1) /* (SPI) SPI Disable*/
#define AT91C_SPI_SWRST       ((unsigned int) 0x1 <<  7) /* (SPI) SPI Software reset*/
#define AT91C_SPI_LASTXFER    ((unsigned int) 0x1 << 24) /* (SPI) SPI Last Transfer*/
/* -------- SPI_MR : (SPI Offset: 0x4) SPI Mode Register -------- */
#define AT91C_SPI_MSTR        ((unsigned int) 0x1 <<  0) /* (SPI) Master/Slave Mode*/
#define AT91C_SPI_PS          ((unsigned int) 0x1 <<  1) /* (SPI) Peripheral Select*/
#define 	AT91C_SPI_PS_FIXED                ((unsigned int) 0x0 <<  1) /* (SPI) Fixed Peripheral Select*/
#define 	AT91C_SPI_PS_VARIABLE             ((unsigned int) 0x1 <<  1) /* (SPI) Variable Peripheral Select*/
#define AT91C_SPI_PCSDEC      ((unsigned int) 0x1 <<  2) /* (SPI) Chip Select Decode*/
#define AT91C_SPI_FDIV        ((unsigned int) 0x1 <<  3) /* (SPI) Clock Selection*/
#define AT91C_SPI_MODFDIS     ((unsigned int) 0x1 <<  4) /* (SPI) Mode Fault Detection*/
#define AT91C_SPI_LLB         ((unsigned int) 0x1 <<  7) /* (SPI) Clock Selection*/
#define AT91C_SPI_PCS         ((unsigned int) 0xF << 16) /* (SPI) Peripheral Chip Select*/
#define AT91C_SPI_DLYBCS      ((unsigned int) 0xFF << 24) /* (SPI) Delay Between Chip Selects*/
/* -------- SPI_RDR : (SPI Offset: 0x8) Receive Data Register -------- */
#define AT91C_SPI_RD          ((unsigned int) 0xFFFF <<  0) /* (SPI) Receive Data*/
#define AT91C_SPI_RPCS        ((unsigned int) 0xF << 16) /* (SPI) Peripheral Chip Select Status*/
/* -------- SPI_TDR : (SPI Offset: 0xc) Transmit Data Register -------- */
#define AT91C_SPI_TD          ((unsigned int) 0xFFFF <<  0) /* (SPI) Transmit Data*/
#define AT91C_SPI_TPCS        ((unsigned int) 0xF << 16) /* (SPI) Peripheral Chip Select Status*/
/* -------- SPI_SR : (SPI Offset: 0x10) Status Register -------- */
#define AT91C_SPI_RDRF        ((unsigned int) 0x1 <<  0) /* (SPI) Receive Data Register Full*/
#define AT91C_SPI_TDRE        ((unsigned int) 0x1 <<  1) /* (SPI) Transmit Data Register Empty*/
#define AT91C_SPI_MODF        ((unsigned int) 0x1 <<  2) /* (SPI) Mode Fault Error*/
#define AT91C_SPI_OVRES       ((unsigned int) 0x1 <<  3) /* (SPI) Overrun Error Status*/
#define AT91C_SPI_ENDRX       ((unsigned int) 0x1 <<  4) /* (SPI) End of Receiver Transfer*/
#define AT91C_SPI_ENDTX       ((unsigned int) 0x1 <<  5) /* (SPI) End of Receiver Transfer*/
#define AT91C_SPI_RXBUFF      ((unsigned int) 0x1 <<  6) /* (SPI) RXBUFF Interrupt*/
#define AT91C_SPI_TXBUFE      ((unsigned int) 0x1 <<  7) /* (SPI) TXBUFE Interrupt*/
#define AT91C_SPI_NSSR        ((unsigned int) 0x1 <<  8) /* (SPI) NSSR Interrupt*/
#define AT91C_SPI_TXEMPTY     ((unsigned int) 0x1 <<  9) /* (SPI) TXEMPTY Interrupt*/
#define AT91C_SPI_SPIENS      ((unsigned int) 0x1 << 16) /* (SPI) Enable Status*/
/* -------- SPI_IER : (SPI Offset: 0x14) Interrupt Enable Register -------- */
/* -------- SPI_IDR : (SPI Offset: 0x18) Interrupt Disable Register -------- */
/* -------- SPI_IMR : (SPI Offset: 0x1c) Interrupt Mask Register -------- */
/* -------- SPI_CSR : (SPI Offset: 0x30) Chip Select Register -------- */
#define AT91C_SPI_CPOL        ((unsigned int) 0x1 <<  0) /* (SPI) Clock Polarity*/
#define AT91C_SPI_NCPHA       ((unsigned int) 0x1 <<  1) /* (SPI) Clock Phase*/
#define AT91C_SPI_CSAAT       ((unsigned int) 0x1 <<  3) /* (SPI) Chip Select Active After Transfer*/
#define AT91C_SPI_BITS        ((unsigned int) 0xF <<  4) /* (SPI) Bits Per Transfer*/
#define 	AT91C_SPI_BITS_8                    ((unsigned int) 0x0 <<  4) /* (SPI) 8 Bits Per transfer*/
#define 	AT91C_SPI_BITS_9                    ((unsigned int) 0x1 <<  4) /* (SPI) 9 Bits Per transfer*/
#define 	AT91C_SPI_BITS_10                   ((unsigned int) 0x2 <<  4) /* (SPI) 10 Bits Per transfer*/
#define 	AT91C_SPI_BITS_11                   ((unsigned int) 0x3 <<  4) /* (SPI) 11 Bits Per transfer*/
#define 	AT91C_SPI_BITS_12                   ((unsigned int) 0x4 <<  4) /* (SPI) 12 Bits Per transfer*/
#define 	AT91C_SPI_BITS_13                   ((unsigned int) 0x5 <<  4) /* (SPI) 13 Bits Per transfer*/
#define 	AT91C_SPI_BITS_14                   ((unsigned int) 0x6 <<  4) /* (SPI) 14 Bits Per transfer*/
#define 	AT91C_SPI_BITS_15                   ((unsigned int) 0x7 <<  4) /* (SPI) 15 Bits Per transfer*/
#define 	AT91C_SPI_BITS_16                   ((unsigned int) 0x8 <<  4) /* (SPI) 16 Bits Per transfer*/
#define AT91C_SPI_SCBR        ((unsigned int) 0xFF <<  8) /* (SPI) Serial Clock Baud Rate*/
#define AT91C_SPI_DLYBS       ((unsigned int) 0xFF << 16) /* (SPI) Delay Before SPCK*/
#define AT91C_SPI_DLYBCT      ((unsigned int) 0xFF << 24) /* (SPI) Delay Between Consecutive Transfers*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Analog to Digital Convertor*/
/* ******************************************************************************/
typedef struct _AT91S_ADC {
	AT91_REG	 ADC_CR; 	/* ADC Control Register*/
	AT91_REG	 ADC_MR; 	/* ADC Mode Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 ADC_CHER; 	/* ADC Channel Enable Register*/
	AT91_REG	 ADC_CHDR; 	/* ADC Channel Disable Register*/
	AT91_REG	 ADC_CHSR; 	/* ADC Channel Status Register*/
	AT91_REG	 ADC_SR; 	/* ADC Status Register*/
	AT91_REG	 ADC_LCDR; 	/* ADC Last Converted Data Register*/
	AT91_REG	 ADC_IER; 	/* ADC Interrupt Enable Register*/
	AT91_REG	 ADC_IDR; 	/* ADC Interrupt Disable Register*/
	AT91_REG	 ADC_IMR; 	/* ADC Interrupt Mask Register*/
	AT91_REG	 ADC_CDR0; 	/* ADC Channel Data Register 0*/
	AT91_REG	 ADC_CDR1; 	/* ADC Channel Data Register 1*/
	AT91_REG	 ADC_CDR2; 	/* ADC Channel Data Register 2*/
	AT91_REG	 ADC_CDR3; 	/* ADC Channel Data Register 3*/
	AT91_REG	 ADC_CDR4; 	/* ADC Channel Data Register 4*/
	AT91_REG	 ADC_CDR5; 	/* ADC Channel Data Register 5*/
	AT91_REG	 ADC_CDR6; 	/* ADC Channel Data Register 6*/
	AT91_REG	 ADC_CDR7; 	/* ADC Channel Data Register 7*/
	AT91_REG	 Reserved1[44]; 	/* */
	AT91_REG	 ADC_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 ADC_RCR; 	/* Receive Counter Register*/
	AT91_REG	 ADC_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 ADC_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 ADC_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 ADC_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 ADC_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 ADC_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 ADC_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 ADC_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_ADC, *AT91PS_ADC;

/* -------- ADC_CR : (ADC Offset: 0x0) ADC Control Register -------- */
#define AT91C_ADC_SWRST       ((unsigned int) 0x1 <<  0) /* (ADC) Software Reset*/
#define AT91C_ADC_START       ((unsigned int) 0x1 <<  1) /* (ADC) Start Conversion*/
/* -------- ADC_MR : (ADC Offset: 0x4) ADC Mode Register -------- */
#define AT91C_ADC_TRGEN       ((unsigned int) 0x1 <<  0) /* (ADC) Trigger Enable*/
#define 	AT91C_ADC_TRGEN_DIS                  ((unsigned int) 0x0) /* (ADC) Hradware triggers are disabled. Starting a conversion is only possible by software*/
#define 	AT91C_ADC_TRGEN_EN                   ((unsigned int) 0x1) /* (ADC) Hardware trigger selected by TRGSEL field is enabled.*/
#define AT91C_ADC_TRGSEL      ((unsigned int) 0x7 <<  1) /* (ADC) Trigger Selection*/
#define 	AT91C_ADC_TRGSEL_TIOA0                ((unsigned int) 0x0 <<  1) /* (ADC) Selected TRGSEL = TIAO0*/
#define 	AT91C_ADC_TRGSEL_TIOA1                ((unsigned int) 0x1 <<  1) /* (ADC) Selected TRGSEL = TIAO1*/
#define 	AT91C_ADC_TRGSEL_TIOA2                ((unsigned int) 0x2 <<  1) /* (ADC) Selected TRGSEL = TIAO2*/
#define 	AT91C_ADC_TRGSEL_TIOA3                ((unsigned int) 0x3 <<  1) /* (ADC) Selected TRGSEL = TIAO3*/
#define 	AT91C_ADC_TRGSEL_TIOA4                ((unsigned int) 0x4 <<  1) /* (ADC) Selected TRGSEL = TIAO4*/
#define 	AT91C_ADC_TRGSEL_TIOA5                ((unsigned int) 0x5 <<  1) /* (ADC) Selected TRGSEL = TIAO5*/
#define 	AT91C_ADC_TRGSEL_EXT                  ((unsigned int) 0x6 <<  1) /* (ADC) Selected TRGSEL = External Trigger*/
#define AT91C_ADC_LOWRES      ((unsigned int) 0x1 <<  4) /* (ADC) Resolution.*/
#define 	AT91C_ADC_LOWRES_10_BIT               ((unsigned int) 0x0 <<  4) /* (ADC) 10-bit resolution*/
#define 	AT91C_ADC_LOWRES_8_BIT                ((unsigned int) 0x1 <<  4) /* (ADC) 8-bit resolution*/
#define AT91C_ADC_SLEEP       ((unsigned int) 0x1 <<  5) /* (ADC) Sleep Mode*/
#define 	AT91C_ADC_SLEEP_NORMAL_MODE          ((unsigned int) 0x0 <<  5) /* (ADC) Normal Mode*/
#define 	AT91C_ADC_SLEEP_MODE                 ((unsigned int) 0x1 <<  5) /* (ADC) Sleep Mode*/
#define AT91C_ADC_PRESCAL     ((unsigned int) 0x3F <<  8) /* (ADC) Prescaler rate selection*/
#define AT91C_ADC_STARTUP     ((unsigned int) 0x1F << 16) /* (ADC) Startup Time*/
#define AT91C_ADC_SHTIM       ((unsigned int) 0xF << 24) /* (ADC) Sample & Hold Time*/
/* -------- 	ADC_CHER : (ADC Offset: 0x10) ADC Channel Enable Register -------- */
#define AT91C_ADC_CH0         ((unsigned int) 0x1 <<  0) /* (ADC) Channel 0*/
#define AT91C_ADC_CH1         ((unsigned int) 0x1 <<  1) /* (ADC) Channel 1*/
#define AT91C_ADC_CH2         ((unsigned int) 0x1 <<  2) /* (ADC) Channel 2*/
#define AT91C_ADC_CH3         ((unsigned int) 0x1 <<  3) /* (ADC) Channel 3*/
#define AT91C_ADC_CH4         ((unsigned int) 0x1 <<  4) /* (ADC) Channel 4*/
#define AT91C_ADC_CH5         ((unsigned int) 0x1 <<  5) /* (ADC) Channel 5*/
#define AT91C_ADC_CH6         ((unsigned int) 0x1 <<  6) /* (ADC) Channel 6*/
#define AT91C_ADC_CH7         ((unsigned int) 0x1 <<  7) /* (ADC) Channel 7*/
/* -------- 	ADC_CHDR : (ADC Offset: 0x14) ADC Channel Disable Register -------- */
/* -------- 	ADC_CHSR : (ADC Offset: 0x18) ADC Channel Status Register -------- */
/* -------- ADC_SR : (ADC Offset: 0x1c) ADC Status Register -------- */
#define AT91C_ADC_EOC0        ((unsigned int) 0x1 <<  0) /* (ADC) End of Conversion*/
#define AT91C_ADC_EOC1        ((unsigned int) 0x1 <<  1) /* (ADC) End of Conversion*/
#define AT91C_ADC_EOC2        ((unsigned int) 0x1 <<  2) /* (ADC) End of Conversion*/
#define AT91C_ADC_EOC3        ((unsigned int) 0x1 <<  3) /* (ADC) End of Conversion*/
#define AT91C_ADC_EOC4        ((unsigned int) 0x1 <<  4) /* (ADC) End of Conversion*/
#define AT91C_ADC_EOC5        ((unsigned int) 0x1 <<  5) /* (ADC) End of Conversion*/
#define AT91C_ADC_EOC6        ((unsigned int) 0x1 <<  6) /* (ADC) End of Conversion*/
#define AT91C_ADC_EOC7        ((unsigned int) 0x1 <<  7) /* (ADC) End of Conversion*/
#define AT91C_ADC_OVRE0       ((unsigned int) 0x1 <<  8) /* (ADC) Overrun Error*/
#define AT91C_ADC_OVRE1       ((unsigned int) 0x1 <<  9) /* (ADC) Overrun Error*/
#define AT91C_ADC_OVRE2       ((unsigned int) 0x1 << 10) /* (ADC) Overrun Error*/
#define AT91C_ADC_OVRE3       ((unsigned int) 0x1 << 11) /* (ADC) Overrun Error*/
#define AT91C_ADC_OVRE4       ((unsigned int) 0x1 << 12) /* (ADC) Overrun Error*/
#define AT91C_ADC_OVRE5       ((unsigned int) 0x1 << 13) /* (ADC) Overrun Error*/
#define AT91C_ADC_OVRE6       ((unsigned int) 0x1 << 14) /* (ADC) Overrun Error*/
#define AT91C_ADC_OVRE7       ((unsigned int) 0x1 << 15) /* (ADC) Overrun Error*/
#define AT91C_ADC_DRDY        ((unsigned int) 0x1 << 16) /* (ADC) Data Ready*/
#define AT91C_ADC_GOVRE       ((unsigned int) 0x1 << 17) /* (ADC) General Overrun*/
#define AT91C_ADC_ENDRX       ((unsigned int) 0x1 << 18) /* (ADC) End of Receiver Transfer*/
#define AT91C_ADC_RXBUFF      ((unsigned int) 0x1 << 19) /* (ADC) RXBUFF Interrupt*/
/* -------- ADC_LCDR : (ADC Offset: 0x20) ADC Last Converted Data Register -------- */
#define AT91C_ADC_LDATA       ((unsigned int) 0x3FF <<  0) /* (ADC) Last Data Converted*/
/* -------- ADC_IER : (ADC Offset: 0x24) ADC Interrupt Enable Register -------- */
/* -------- ADC_IDR : (ADC Offset: 0x28) ADC Interrupt Disable Register -------- */
/* -------- ADC_IMR : (ADC Offset: 0x2c) ADC Interrupt Mask Register -------- */
/* -------- ADC_CDR0 : (ADC Offset: 0x30) ADC Channel Data Register 0 -------- */
#define AT91C_ADC_DATA        ((unsigned int) 0x3FF <<  0) /* (ADC) Converted Data*/
/* -------- ADC_CDR1 : (ADC Offset: 0x34) ADC Channel Data Register 1 -------- */
/* -------- ADC_CDR2 : (ADC Offset: 0x38) ADC Channel Data Register 2 -------- */
/* -------- ADC_CDR3 : (ADC Offset: 0x3c) ADC Channel Data Register 3 -------- */
/* -------- ADC_CDR4 : (ADC Offset: 0x40) ADC Channel Data Register 4 -------- */
/* -------- ADC_CDR5 : (ADC Offset: 0x44) ADC Channel Data Register 5 -------- */
/* -------- ADC_CDR6 : (ADC Offset: 0x48) ADC Channel Data Register 6 -------- */
/* -------- ADC_CDR7 : (ADC Offset: 0x4c) ADC Channel Data Register 7 -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Ethernet MAC 10/100*/
/* ******************************************************************************/
typedef struct _AT91S_EMAC {
	AT91_REG	 EMAC_NCR; 	/* Network Control Register*/
	AT91_REG	 EMAC_NCFGR; 	/* Network Configuration Register*/
	AT91_REG	 EMAC_NSR; 	/* Network Status Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 EMAC_TSR; 	/* Transmit Status Register*/
	AT91_REG	 EMAC_RBQP; 	/* Receive Buffer Queue Pointer*/
	AT91_REG	 EMAC_TBQP; 	/* Transmit Buffer Queue Pointer*/
	AT91_REG	 EMAC_RSR; 	/* Receive Status Register*/
	AT91_REG	 EMAC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 EMAC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 EMAC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 EMAC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 EMAC_MAN; 	/* PHY Maintenance Register*/
	AT91_REG	 EMAC_PTR; 	/* Pause Time Register*/
	AT91_REG	 EMAC_PFR; 	/* Pause Frames received Register*/
	AT91_REG	 EMAC_FTO; 	/* Frames Transmitted OK Register*/
	AT91_REG	 EMAC_SCF; 	/* Single Collision Frame Register*/
	AT91_REG	 EMAC_MCF; 	/* Multiple Collision Frame Register*/
	AT91_REG	 EMAC_FRO; 	/* Frames Received OK Register*/
	AT91_REG	 EMAC_FCSE; 	/* Frame Check Sequence Error Register*/
	AT91_REG	 EMAC_ALE; 	/* Alignment Error Register*/
	AT91_REG	 EMAC_DTF; 	/* Deferred Transmission Frame Register*/
	AT91_REG	 EMAC_LCOL; 	/* Late Collision Register*/
	AT91_REG	 EMAC_ECOL; 	/* Excessive Collision Register*/
	AT91_REG	 EMAC_TUND; 	/* Transmit Underrun Error Register*/
	AT91_REG	 EMAC_CSE; 	/* Carrier Sense Error Register*/
	AT91_REG	 EMAC_RRE; 	/* Receive Ressource Error Register*/
	AT91_REG	 EMAC_ROV; 	/* Receive Overrun Errors Register*/
	AT91_REG	 EMAC_RSE; 	/* Receive Symbol Errors Register*/
	AT91_REG	 EMAC_ELE; 	/* Excessive Length Errors Register*/
	AT91_REG	 EMAC_RJA; 	/* Receive Jabbers Register*/
	AT91_REG	 EMAC_USF; 	/* Undersize Frames Register*/
	AT91_REG	 EMAC_STE; 	/* SQE Test Error Register*/
	AT91_REG	 EMAC_RLE; 	/* Receive Length Field Mismatch Register*/
	AT91_REG	 EMAC_TPF; 	/* Transmitted Pause Frames Register*/
	AT91_REG	 EMAC_HRB; 	/* Hash Address Bottom[31:0]*/
	AT91_REG	 EMAC_HRT; 	/* Hash Address Top[63:32]*/
	AT91_REG	 EMAC_SA1L; 	/* Specific Address 1 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA1H; 	/* Specific Address 1 Top, Last 2 bytes*/
	AT91_REG	 EMAC_SA2L; 	/* Specific Address 2 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA2H; 	/* Specific Address 2 Top, Last 2 bytes*/
	AT91_REG	 EMAC_SA3L; 	/* Specific Address 3 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA3H; 	/* Specific Address 3 Top, Last 2 bytes*/
	AT91_REG	 EMAC_SA4L; 	/* Specific Address 4 Bottom, First 4 bytes*/
	AT91_REG	 EMAC_SA4H; 	/* Specific Address 4 Top, Last 2 bytes*/
	AT91_REG	 EMAC_TID; 	/* Type ID Checking Register*/
	AT91_REG	 EMAC_TPQ; 	/* Transmit Pause Quantum Register*/
	AT91_REG	 EMAC_USRIO; 	/* USER Input/Output Register*/
	AT91_REG	 EMAC_WOL; 	/* Wake On LAN Register*/
	AT91_REG	 Reserved1[13]; 	/* */
	AT91_REG	 EMAC_REV; 	/* Revision Register*/
} AT91S_EMAC, *AT91PS_EMAC;

/* -------- EMAC_NCR : (EMAC Offset: 0x0)  -------- */
#define AT91C_EMAC_LB         ((unsigned int) 0x1 <<  0) /* (EMAC) Loopback. Optional. When set, loopback signal is at high level.*/
#define AT91C_EMAC_LLB        ((unsigned int) 0x1 <<  1) /* (EMAC) Loopback local. */
#define AT91C_EMAC_RE         ((unsigned int) 0x1 <<  2) /* (EMAC) Receive enable. */
#define AT91C_EMAC_TE         ((unsigned int) 0x1 <<  3) /* (EMAC) Transmit enable. */
#define AT91C_EMAC_MPE        ((unsigned int) 0x1 <<  4) /* (EMAC) Management port enable. */
#define AT91C_EMAC_CLRSTAT    ((unsigned int) 0x1 <<  5) /* (EMAC) Clear statistics registers. */
#define AT91C_EMAC_INCSTAT    ((unsigned int) 0x1 <<  6) /* (EMAC) Increment statistics registers. */
#define AT91C_EMAC_WESTAT     ((unsigned int) 0x1 <<  7) /* (EMAC) Write enable for statistics registers. */
#define AT91C_EMAC_BP         ((unsigned int) 0x1 <<  8) /* (EMAC) Back pressure. */
#define AT91C_EMAC_TSTART     ((unsigned int) 0x1 <<  9) /* (EMAC) Start Transmission. */
#define AT91C_EMAC_THALT      ((unsigned int) 0x1 << 10) /* (EMAC) Transmission Halt. */
#define AT91C_EMAC_TPFR       ((unsigned int) 0x1 << 11) /* (EMAC) Transmit pause frame */
#define AT91C_EMAC_TZQ        ((unsigned int) 0x1 << 12) /* (EMAC) Transmit zero quantum pause frame*/
/* -------- EMAC_NCFGR : (EMAC Offset: 0x4) Network Configuration Register -------- */
#define AT91C_EMAC_SPD        ((unsigned int) 0x1 <<  0) /* (EMAC) Speed. */
#define AT91C_EMAC_FD         ((unsigned int) 0x1 <<  1) /* (EMAC) Full duplex. */
#define AT91C_EMAC_JFRAME     ((unsigned int) 0x1 <<  3) /* (EMAC) Jumbo Frames. */
#define AT91C_EMAC_CAF        ((unsigned int) 0x1 <<  4) /* (EMAC) Copy all frames. */
#define AT91C_EMAC_NBC        ((unsigned int) 0x1 <<  5) /* (EMAC) No broadcast. */
#define AT91C_EMAC_MTI        ((unsigned int) 0x1 <<  6) /* (EMAC) Multicast hash event enable*/
#define AT91C_EMAC_UNI        ((unsigned int) 0x1 <<  7) /* (EMAC) Unicast hash enable. */
#define AT91C_EMAC_BIG        ((unsigned int) 0x1 <<  8) /* (EMAC) Receive 1522 bytes. */
#define AT91C_EMAC_EAE        ((unsigned int) 0x1 <<  9) /* (EMAC) External address match enable. */
#define AT91C_EMAC_CLK        ((unsigned int) 0x3 << 10) /* (EMAC) */
#define 	AT91C_EMAC_CLK_HCLK_8               ((unsigned int) 0x0 << 10) /* (EMAC) HCLK divided by 8*/
#define 	AT91C_EMAC_CLK_HCLK_16              ((unsigned int) 0x1 << 10) /* (EMAC) HCLK divided by 16*/
#define 	AT91C_EMAC_CLK_HCLK_32              ((unsigned int) 0x2 << 10) /* (EMAC) HCLK divided by 32*/
#define 	AT91C_EMAC_CLK_HCLK_64              ((unsigned int) 0x3 << 10) /* (EMAC) HCLK divided by 64*/
#define AT91C_EMAC_RTY        ((unsigned int) 0x1 << 12) /* (EMAC) */
#define AT91C_EMAC_PAE        ((unsigned int) 0x1 << 13) /* (EMAC) */
#define AT91C_EMAC_RBOF       ((unsigned int) 0x3 << 14) /* (EMAC) */
#define 	AT91C_EMAC_RBOF_OFFSET_0             ((unsigned int) 0x0 << 14) /* (EMAC) no offset from start of receive buffer*/
#define 	AT91C_EMAC_RBOF_OFFSET_1             ((unsigned int) 0x1 << 14) /* (EMAC) one byte offset from start of receive buffer*/
#define 	AT91C_EMAC_RBOF_OFFSET_2             ((unsigned int) 0x2 << 14) /* (EMAC) two bytes offset from start of receive buffer*/
#define 	AT91C_EMAC_RBOF_OFFSET_3             ((unsigned int) 0x3 << 14) /* (EMAC) three bytes offset from start of receive buffer*/
#define AT91C_EMAC_RLCE       ((unsigned int) 0x1 << 16) /* (EMAC) Receive Length field Checking Enable*/
#define AT91C_EMAC_DRFCS      ((unsigned int) 0x1 << 17) /* (EMAC) Discard Receive FCS*/
#define AT91C_EMAC_EFRHD      ((unsigned int) 0x1 << 18) /* (EMAC) */
#define AT91C_EMAC_IRXFCS     ((unsigned int) 0x1 << 19) /* (EMAC) Ignore RX FCS*/
/* -------- EMAC_NSR : (EMAC Offset: 0x8) Network Status Register -------- */
#define AT91C_EMAC_LINKR      ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_MDIO       ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_IDLE       ((unsigned int) 0x1 <<  2) /* (EMAC) */
/* -------- EMAC_TSR : (EMAC Offset: 0x14) Transmit Status Register -------- */
#define AT91C_EMAC_UBR        ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_COL        ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_RLES       ((unsigned int) 0x1 <<  2) /* (EMAC) */
#define AT91C_EMAC_TGO        ((unsigned int) 0x1 <<  3) /* (EMAC) Transmit Go*/
#define AT91C_EMAC_BEX        ((unsigned int) 0x1 <<  4) /* (EMAC) Buffers exhausted mid frame*/
#define AT91C_EMAC_COMP       ((unsigned int) 0x1 <<  5) /* (EMAC) */
#define AT91C_EMAC_UND        ((unsigned int) 0x1 <<  6) /* (EMAC) */
/* -------- EMAC_RSR : (EMAC Offset: 0x20) Receive Status Register -------- */
#define AT91C_EMAC_BNA        ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_REC        ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_OVR        ((unsigned int) 0x1 <<  2) /* (EMAC) */
/* -------- EMAC_ISR : (EMAC Offset: 0x24) Interrupt Status Register -------- */
#define AT91C_EMAC_MFD        ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_RCOMP      ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_RXUBR      ((unsigned int) 0x1 <<  2) /* (EMAC) */
#define AT91C_EMAC_TXUBR      ((unsigned int) 0x1 <<  3) /* (EMAC) */
#define AT91C_EMAC_TUNDR      ((unsigned int) 0x1 <<  4) /* (EMAC) */
#define AT91C_EMAC_RLEX       ((unsigned int) 0x1 <<  5) /* (EMAC) */
#define AT91C_EMAC_TXERR      ((unsigned int) 0x1 <<  6) /* (EMAC) */
#define AT91C_EMAC_TCOMP      ((unsigned int) 0x1 <<  7) /* (EMAC) */
#define AT91C_EMAC_LINK       ((unsigned int) 0x1 <<  9) /* (EMAC) */
#define AT91C_EMAC_ROVR       ((unsigned int) 0x1 << 10) /* (EMAC) */
#define AT91C_EMAC_HRESP      ((unsigned int) 0x1 << 11) /* (EMAC) */
#define AT91C_EMAC_PFRE       ((unsigned int) 0x1 << 12) /* (EMAC) */
#define AT91C_EMAC_PTZ        ((unsigned int) 0x1 << 13) /* (EMAC) */
/* -------- EMAC_IER : (EMAC Offset: 0x28) Interrupt Enable Register -------- */
/* -------- EMAC_IDR : (EMAC Offset: 0x2c) Interrupt Disable Register -------- */
/* -------- EMAC_IMR : (EMAC Offset: 0x30) Interrupt Mask Register -------- */
/* -------- EMAC_MAN : (EMAC Offset: 0x34) PHY Maintenance Register -------- */
#define AT91C_EMAC_DATA       ((unsigned int) 0xFFFF <<  0) /* (EMAC) */
#define AT91C_EMAC_CODE       ((unsigned int) 0x3 << 16) /* (EMAC) */
#define AT91C_EMAC_REGA       ((unsigned int) 0x1F << 18) /* (EMAC) */
#define AT91C_EMAC_PHYA       ((unsigned int) 0x1F << 23) /* (EMAC) */
#define AT91C_EMAC_RW         ((unsigned int) 0x3 << 28) /* (EMAC) */
#define AT91C_EMAC_SOF        ((unsigned int) 0x3 << 30) /* (EMAC) */
/* -------- EMAC_USRIO : (EMAC Offset: 0xc0) USER Input Output Register -------- */
#define AT91C_EMAC_RMII       ((unsigned int) 0x1 <<  0) /* (EMAC) Reduce MII*/
#define AT91C_EMAC_CLKEN      ((unsigned int) 0x1 <<  1) /* (EMAC) Clock Enable*/
/* -------- EMAC_WOL : (EMAC Offset: 0xc4) Wake On LAN Register -------- */
#define AT91C_EMAC_IP         ((unsigned int) 0xFFFF <<  0) /* (EMAC) ARP request IP address*/
#define AT91C_EMAC_MAG        ((unsigned int) 0x1 << 16) /* (EMAC) Magic packet event enable*/
#define AT91C_EMAC_ARP        ((unsigned int) 0x1 << 17) /* (EMAC) ARP request event enable*/
#define AT91C_EMAC_SA1        ((unsigned int) 0x1 << 18) /* (EMAC) Specific address register 1 event enable*/
/* -------- EMAC_REV : (EMAC Offset: 0xfc) Revision Register -------- */
#define AT91C_EMAC_REVREF     ((unsigned int) 0xFFFF <<  0) /* (EMAC) */
#define AT91C_EMAC_PARTREF    ((unsigned int) 0xFFFF << 16) /* (EMAC) */

