una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9xe512.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Advanced Interrupt Controller*/
/* - ******************************************************************************/
/* - -------- AIC_SMR : (AIC Offset: 0x0) Control Register -------- */
AT91C_AIC_PRIOR           EQU (0x7 <<  0) ;- (AIC) Priority Level
AT91C_AIC_PRIOR_LOWEST    EQU (0x0) ;- (AIC) Lowest priority level
AT91C_AIC_PRIOR_HIGHEST   EQU (0x7) ;- (AIC) Highest priority level
AT91C_AIC_SRCTYPE         EQU (0x3 <<  5) ;- (AIC) Interrupt Source Type
AT91C_AIC_SRCTYPE_INT_LEVEL_SENSITIVE EQU (0x0 <<  5) ;- (AIC) Internal Sources Code Label Level Sensitive
AT91C_AIC_SRCTYPE_INT_EDGE_TRIGGERED EQU (0x1 <<  5) ;- (AIC) Internal Sources Code Label Edge triggered
AT91C_AIC_SRCTYPE_EXT_HIGH_LEVEL EQU (0x2 <<  5) ;- (AIC) External Sources Code Label High-level Sensitive
AT91C_AIC_SRCTYPE_EXT_POSITIVE_EDGE EQU (0x3 <<  5) ;- (AIC) External Sources Code Label Positive Edge triggered
/* - -------- AIC_CISR : (AIC Offset: 0x114) AIC Core Interrupt Status Register -------- */
AT91C_AIC_NFIQ            EQU (0x1 <<  0) ;- (AIC) NFIQ Status
AT91C_AIC_NIRQ            EQU (0x1 <<  1) ;- (AIC) NIRQ Status
/* - -------- AIC_DCR : (AIC Offset: 0x138) AIC Debug Control Register (Protect) -------- */
AT91C_AIC_DCR_PROT        EQU (0x1 <<  0) ;- (AIC) Protection Mode
AT91C_AIC_DCR_GMSK        EQU (0x1 <<  1) ;- (AIC) General Mask

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Parallel Input Output Controler*/
/* - ******************************************************************************/

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Embedded Flash Controller 2.0*/
/* - ******************************************************************************/
/* - -------- EFC_FMR : (EFC Offset: 0x0) EFC Flash Mode Register -------- */
AT91C_EFC_FRDY            EQU (0x1 <<  0) ;- (EFC) Ready Interrupt Enable
AT91C_EFC_FWS             EQU (0xF <<  8) ;- (EFC) Flash Wait State.
AT91C_EFC_FWS_0WS         EQU (0x0 <<  8) ;- (EFC) 0 Wait State
AT91C_EFC_FWS_1WS         EQU (0x1 <<  8) ;- (EFC) 1 Wait State
AT91C_EFC_FWS_2WS         EQU (0x2 <<  8) ;- (EFC) 2 Wait States
AT91C_EFC_FWS_3WS         EQU (0x3 <<  8) ;- (EFC) 3 Wait States
/* - -------- EFC_FCR : (EFC Offset: 0x4) EFC Flash Command Register -------- */
AT91C_EFC_FCMD            EQU (0xFF <<  0) ;- (EFC) Flash Command
AT91C_EFC_FCMD_GETD       EQU (0x0) ;- (EFC) Get Flash Descriptor
AT91C_EFC_FCMD_WP         EQU (0x1) ;- (EFC) Write Page
AT91C_EFC_FCMD_WPL        EQU (0x2) ;- (EFC) Write Page and Lock
AT91C_EFC_FCMD_EWP        EQU (0x3) ;- (EFC) Erase Page and Write Page
AT91C_EFC_FCMD_EWPL       EQU (0x4) ;- (EFC) Erase Page and Write Page then Lock
AT91C_EFC_FCMD_EA         EQU (0x5) ;- (EFC) Erase All
AT91C_EFC_FCMD_EPL        EQU (0x6) ;- (EFC) Erase Plane
AT91C_EFC_FCMD_EPA        EQU (0x7) ;- (EFC) Erase Pages
AT91C_EFC_FCMD_SLB        EQU (0x8) ;- (EFC) Set Lock Bit
AT91C_EFC_FCMD_CLB        EQU (0x9) ;- (EFC) Clear Lock Bit
AT91C_EFC_FCMD_GLB        EQU (0xA) ;- (EFC) Get Lock Bit
AT91C_EFC_FCMD_SFB        EQU (0xB) ;- (EFC) Set Fuse Bit
AT91C_EFC_FCMD_CFB        EQU (0xC) ;- (EFC) Clear Fuse Bit
AT91C_EFC_FCMD_GFB        EQU (0xD) ;- (EFC) Get Fuse Bit
AT91C_EFC_FARG            EQU (0xFFFF <<  8) ;- (EFC) Flash Command Argument
AT91C_EFC_FKEY            EQU (0xFF << 24) ;- (EFC) Flash Writing Protection Key
/* - -------- EFC_FSR : (EFC Offset: 0x8) EFC Flash Status Register -------- */
AT91C_EFC_FRDY_S          EQU (0x1 <<  0) ;- (EFC) Flash Ready Status
AT91C_EFC_FCMDE           EQU (0x1 <<  1) ;- (EFC) Flash Command Error Status
AT91C_EFC_LOCKE           EQU (0x1 <<  2) ;- (EFC) Flash Lock Error Status
/* - -------- EFC_FRR : (EFC Offset: 0xc) EFC Flash Result Register -------- */
AT91C_EFC_FVALUE          EQU (0x0 <<  0) ;- (EFC) Flash Result Value

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Clock Generator Controler*/
/* - ******************************************************************************/
/* - -------- CKGR_MOR : (CKGR Offset: 0x0) Main Oscillator Register -------- */
AT91C_CKGR_MOSCEN         EQU (0x1 <<  0) ;- (CKGR) Main Oscillator Enable
AT91C_CKGR_OSCBYPASS      EQU (0x1 <<  1) ;- (CKGR) Main Oscillator Bypass
AT91C_CKGR_OSCOUNT        EQU (0xFF <<  8) ;- (CKGR) Main Oscillator Start-up Time
/* - -------- CKGR_MCFR : (CKGR Offset: 0x4) Main Clock Frequency Register -------- */
AT91C_CKGR_MAINF          EQU (0xFFFF <<  0) ;- (CKGR) Main Clock Frequency
AT91C_CKGR_MAINRDY        EQU (0x1 << 16) ;- (CKGR) Main Clock Ready
/* - -------- CKGR_PLLAR : (CKGR Offset: 0x8) PLL A Register -------- */
AT91C_CKGR_DIVA           EQU (0xFF <<  0) ;- (CKGR) Divider A Selected
AT91C_CKGR_DIVA_0         EQU (0x0) ;- (CKGR) Divider A output is 0
AT91C_CKGR_DIVA_BYPASS    EQU (0x1) ;- (CKGR) Divider A is bypassed
AT91C_CKGR_PLLACOUNT      EQU (0x3F <<  8) ;- (CKGR) PLL A Counter
AT91C_CKGR_OUTA           EQU (0x3 << 14) ;- (CKGR) PLL A Output Frequency Range
AT91C_CKGR_OUTA_0         EQU (0x0 << 14) ;- (CKGR) Please refer to the PLLA datasheet
AT91C_CKGR_OUTA_1         EQU (0x1 << 14) ;- (CKGR) Please refer to the PLLA datasheet
AT91C_CKGR_OUTA_2         EQU (0x2 << 14) ;- (CKGR) Please refer to the PLLA datasheet
AT91C_CKGR_OUTA_3         EQU (0x3 << 14) ;- (CKGR) Please refer to the PLLA datasheet
AT91C_CKGR_MULA           EQU (0x7FF << 16) ;- (CKGR) PLL A Multiplier
AT91C_CKGR_SRCA           EQU (0x1 << 29) ;- (CKGR) 
/* - -------- CKGR_PLLBR : (CKGR Offset: 0xc) PLL B Register -------- */
AT91C_CKGR_DIVB           EQU (0xFF <<  0) ;- (CKGR) Divider B Selected
AT91C_CKGR_DIVB_0         EQU (0x0) ;- (CKGR) Divider B output is 0
AT91C_CKGR_DIVB_BYPASS    EQU (0x1) ;- (CKGR) Divider B is bypassed
AT91C_CKGR_PLLBCOUNT      EQU (0x3F <<  8) ;- (CKGR) PLL B Counter
AT91C_CKGR_OUTB           EQU (0x3 << 14) ;- (CKGR) PLL B Output Frequency Range
AT91C_CKGR_OUTB_0         EQU (0x0 << 14) ;- (CKGR) Please refer to the PLLB datasheet
AT91C_CKGR_OUTB_1         EQU (0x1 << 14) ;- (CKGR) Please refer to the PLLB datasheet
AT91C_CKGR_OUTB_2         EQU (0x2 << 14) ;- (CKGR) Please refer to the PLLB datasheet
AT91C_CKGR_OUTB_3         EQU (0x3 << 14) ;- (CKGR) Please refer to the PLLB datasheet
AT91C_CKGR_MULB           EQU (0x7FF << 16) ;- (CKGR) PLL B Multiplier
AT91C_CKGR_USBDIV         EQU (0x3 << 28) ;- (CKGR) Divider for USB Clocks
AT91C_CKGR_USBDIV_0       EQU (0x0 << 28) ;- (CKGR) Divider output is PLL clock output
AT91C_CKGR_USBDIV_1       EQU (0x1 << 28) ;- (CKGR) Divider output is PLL clock output divided by 2
AT91C_CKGR_USBDIV_2       EQU (0x2 << 28) ;- (CKGR) Divider output is PLL clock output divided by 4

