una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9xe512.h
AT91C_TC2_CV              EQU (0xFFFA0090) ;- (TC2) Counter Value
AT91C_TC2_RA              EQU (0xFFFA0094) ;- (TC2) Register A
AT91C_TC2_RB              EQU (0xFFFA0098) ;- (TC2) Register B
AT91C_TC2_IDR             EQU (0xFFFA00A8) ;- (TC2) Interrupt Disable Register
AT91C_TC2_IMR             EQU (0xFFFA00AC) ;- (TC2) Interrupt Mask Register
AT91C_TC2_RC              EQU (0xFFFA009C) ;- (TC2) Register C
AT91C_TC2_IER             EQU (0xFFFA00A4) ;- (TC2) Interrupt Enable Register
AT91C_TC2_SR              EQU (0xFFFA00A0) ;- (TC2) Status Register
/* - ========== Register definition for TC3 peripheral ========== */
AT91C_TC3_IER             EQU (0xFFFDC024) ;- (TC3) Interrupt Enable Register
AT91C_TC3_RB              EQU (0xFFFDC018) ;- (TC3) Register B
AT91C_TC3_CMR             EQU (0xFFFDC004) ;- (TC3) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC3_RC              EQU (0xFFFDC01C) ;- (TC3) Register C
AT91C_TC3_CCR             EQU (0xFFFDC000) ;- (TC3) Channel Control Register
AT91C_TC3_SR              EQU (0xFFFDC020) ;- (TC3) Status Register
AT91C_TC3_CV              EQU (0xFFFDC010) ;- (TC3) Counter Value
AT91C_TC3_RA              EQU (0xFFFDC014) ;- (TC3) Register A
AT91C_TC3_IDR             EQU (0xFFFDC028) ;- (TC3) Interrupt Disable Register
AT91C_TC3_IMR             EQU (0xFFFDC02C) ;- (TC3) Interrupt Mask Register
/* - ========== Register definition for TC4 peripheral ========== */
AT91C_TC4_CMR             EQU (0xFFFDC044) ;- (TC4) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC4_RC              EQU (0xFFFDC05C) ;- (TC4) Register C
AT91C_TC4_SR              EQU (0xFFFDC060) ;- (TC4) Status Register
AT91C_TC4_RB              EQU (0xFFFDC058) ;- (TC4) Register B
AT91C_TC4_IER             EQU (0xFFFDC064) ;- (TC4) Interrupt Enable Register
AT91C_TC4_CV              EQU (0xFFFDC050) ;- (TC4) Counter Value
AT91C_TC4_RA              EQU (0xFFFDC054) ;- (TC4) Register A
AT91C_TC4_IDR             EQU (0xFFFDC068) ;- (TC4) Interrupt Disable Register
AT91C_TC4_IMR             EQU (0xFFFDC06C) ;- (TC4) Interrupt Mask Register
AT91C_TC4_CCR             EQU (0xFFFDC040) ;- (TC4) Channel Control Register
/* - ========== Register definition for TC5 peripheral ========== */
AT91C_TC5_RB              EQU (0xFFFDC098) ;- (TC5) Register B
AT91C_TC5_RA              EQU (0xFFFDC094) ;- (TC5) Register A
AT91C_TC5_CV              EQU (0xFFFDC090) ;- (TC5) Counter Value
AT91C_TC5_CCR             EQU (0xFFFDC080) ;- (TC5) Channel Control Register
AT91C_TC5_SR              EQU (0xFFFDC0A0) ;- (TC5) Status Register
AT91C_TC5_IER             EQU (0xFFFDC0A4) ;- (TC5) Interrupt Enable Register
AT91C_TC5_IDR             EQU (0xFFFDC0A8) ;- (TC5) Interrupt Disable Register
AT91C_TC5_RC              EQU (0xFFFDC09C) ;- (TC5) Register C
AT91C_TC5_IMR             EQU (0xFFFDC0AC) ;- (TC5) Interrupt Mask Register
AT91C_TC5_CMR             EQU (0xFFFDC084) ;- (TC5) Channel Mode Register (Capture Mode / Waveform Mode)
/* - ========== Register definition for TCB0 peripheral ========== */
AT91C_TCB0_BMR            EQU (0xFFFA00C4) ;- (TCB0) TC Block Mode Register
AT91C_TCB0_BCR            EQU (0xFFFA00C0) ;- (TCB0) TC Block Control Register
/* - ========== Register definition for TCB1 peripheral ========== */
AT91C_TCB1_BCR            EQU (0xFFFDC0C0) ;- (TCB1) TC Block Control Register
AT91C_TCB1_BMR            EQU (0xFFFDC0C4) ;- (TCB1) TC Block Mode Register
/* - ========== Register definition for PDC_MCI peripheral ========== */
AT91C_MCI_RNCR            EQU (0xFFFA8114) ;- (PDC_MCI) Receive Next Counter Register
AT91C_MCI_TCR             EQU (0xFFFA810C) ;- (PDC_MCI) Transmit Counter Register
AT91C_MCI_RCR             EQU (0xFFFA8104) ;- (PDC_MCI) Receive Counter Register
AT91C_MCI_TNPR            EQU (0xFFFA8118) ;- (PDC_MCI) Transmit Next Pointer Register
AT91C_MCI_RNPR            EQU (0xFFFA8110) ;- (PDC_MCI) Receive Next Pointer Register
AT91C_MCI_RPR             EQU (0xFFFA8100) ;- (PDC_MCI) Receive Pointer Register
AT91C_MCI_TNCR            EQU (0xFFFA811C) ;- (PDC_MCI) Transmit Next Counter Register
AT91C_MCI_TPR             EQU (0xFFFA8108) ;- (PDC_MCI) Transmit Pointer Register
AT91C_MCI_PTSR            EQU (0xFFFA8124) ;- (PDC_MCI) PDC Transfer Status Register
AT91C_MCI_PTCR            EQU (0xFFFA8120) ;- (PDC_MCI) PDC Transfer Control Register
/* - ========== Register definition for MCI peripheral ========== */
AT91C_MCI_RDR             EQU (0xFFFA8030) ;- (MCI) MCI Receive Data Register
AT91C_MCI_CMDR            EQU (0xFFFA8014) ;- (MCI) MCI Command Register
AT91C_MCI_VR              EQU (0xFFFA80FC) ;- (MCI) MCI Version Register
AT91C_MCI_IDR             EQU (0xFFFA8048) ;- (MCI) MCI Interrupt Disable Register
AT91C_MCI_DTOR            EQU (0xFFFA8008) ;- (MCI) MCI Data Timeout Register
AT91C_MCI_TDR             EQU (0xFFFA8034) ;- (MCI) MCI Transmit Data Register
AT91C_MCI_IER             EQU (0xFFFA8044) ;- (MCI) MCI Interrupt Enable Register
AT91C_MCI_BLKR            EQU (0xFFFA8018) ;- (MCI) MCI Block Register
AT91C_MCI_MR              EQU (0xFFFA8004) ;- (MCI) MCI Mode Register
AT91C_MCI_IMR             EQU (0xFFFA804C) ;- (MCI) MCI Interrupt Mask Register
AT91C_MCI_CR              EQU (0xFFFA8000) ;- (MCI) MCI Control Register
AT91C_MCI_ARGR            EQU (0xFFFA8010) ;- (MCI) MCI Argument Register
AT91C_MCI_SDCR            EQU (0xFFFA800C) ;- (MCI) MCI SD Card Register
AT91C_MCI_SR              EQU (0xFFFA8040) ;- (MCI) MCI Status Register
AT91C_MCI_RSPR            EQU (0xFFFA8020) ;- (MCI) MCI Response Register
/* - ========== Register definition for PDC_TWI0 peripheral ========== */
AT91C_TWI0_PTSR           EQU (0xFFFAC124) ;- (PDC_TWI0) PDC Transfer Status Register
AT91C_TWI0_RPR            EQU (0xFFFAC100) ;- (PDC_TWI0) Receive Pointer Register
AT91C_TWI0_RNCR           EQU (0xFFFAC114) ;- (PDC_TWI0) Receive Next Counter Register
AT91C_TWI0_RCR            EQU (0xFFFAC104) ;- (PDC_TWI0) Receive Counter Register
AT91C_TWI0_PTCR           EQU (0xFFFAC120) ;- (PDC_TWI0) PDC Transfer Control Register
AT91C_TWI0_TPR            EQU (0xFFFAC108) ;- (PDC_TWI0) Transmit Pointer Register
AT91C_TWI0_RNPR           EQU (0xFFFAC110) ;- (PDC_TWI0) Receive Next Pointer Register
AT91C_TWI0_TNPR           EQU (0xFFFAC118) ;- (PDC_TWI0) Transmit Next Pointer Register
AT91C_TWI0_TCR            EQU (0xFFFAC10C) ;- (PDC_TWI0) Transmit Counter Register
AT91C_TWI0_TNCR           EQU (0xFFFAC11C) ;- (PDC_TWI0) Transmit Next Counter Register
/* - ========== Register definition for TWI0 peripheral ========== */
AT91C_TWI0_THR            EQU (0xFFFAC034) ;- (TWI0) Transmit Holding Register
AT91C_TWI0_IDR            EQU (0xFFFAC028) ;- (TWI0) Interrupt Disable Register
AT91C_TWI0_SMR            EQU (0xFFFAC008) ;- (TWI0) Slave Mode Register
AT91C_TWI0_CWGR           EQU (0xFFFAC010) ;- (TWI0) Clock Waveform Generator Register
AT91C_TWI0_IADR           EQU (0xFFFAC00C) ;- (TWI0) Internal Address Register
AT91C_TWI0_RHR            EQU (0xFFFAC030) ;- (TWI0) Receive Holding Register
AT91C_TWI0_IER            EQU (0xFFFAC024) ;- (TWI0) Interrupt Enable Register
AT91C_TWI0_MMR            EQU (0xFFFAC004) ;- (TWI0) Master Mode Register
AT91C_TWI0_SR             EQU (0xFFFAC020) ;- (TWI0) Status Register
AT91C_TWI0_IMR            EQU (0xFFFAC02C) ;- (TWI0) Interrupt Mask Register
AT91C_TWI0_CR             EQU (0xFFFAC000) ;- (TWI0) Control Register
/* - ========== Register definition for PDC_TWI1 peripheral ========== */
AT91C_TWI1_PTSR           EQU (0xFFFD8124) ;- (PDC_TWI1) PDC Transfer Status Register
AT91C_TWI1_PTCR           EQU (0xFFFD8120) ;- (PDC_TWI1) PDC Transfer Control Register
AT91C_TWI1_TNPR           EQU (0xFFFD8118) ;- (PDC_TWI1) Transmit Next Pointer Register
AT91C_TWI1_TNCR           EQU (0xFFFD811C) ;- (PDC_TWI1) Transmit Next Counter Register
AT91C_TWI1_RNPR           EQU (0xFFFD8110) ;- (PDC_TWI1) Receive Next Pointer Register
AT91C_TWI1_RNCR           EQU (0xFFFD8114) ;- (PDC_TWI1) Receive Next Counter Register
AT91C_TWI1_RPR            EQU (0xFFFD8100) ;- (PDC_TWI1) Receive Pointer Register
AT91C_TWI1_TCR            EQU (0xFFFD810C) ;- (PDC_TWI1) Transmit Counter Register
AT91C_TWI1_TPR            EQU (0xFFFD8108) ;- (PDC_TWI1) Transmit Pointer Register
AT91C_TWI1_RCR            EQU (0xFFFD8104) ;- (PDC_TWI1) Receive Counter Register
/* - ========== Register definition for TWI1 peripheral ========== */
AT91C_TWI1_RHR            EQU (0xFFFD8030) ;- (TWI1) Receive Holding Register
AT91C_TWI1_IER            EQU (0xFFFD8024) ;- (TWI1) Interrupt Enable Register
AT91C_TWI1_CWGR           EQU (0xFFFD8010) ;- (TWI1) Clock Waveform Generator Register
AT91C_TWI1_MMR            EQU (0xFFFD8004) ;- (TWI1) Master Mode Register
AT91C_TWI1_IADR           EQU (0xFFFD800C) ;- (TWI1) Internal Address Register
AT91C_TWI1_THR            EQU (0xFFFD8034) ;- (TWI1) Transmit Holding Register
AT91C_TWI1_IMR            EQU (0xFFFD802C) ;- (TWI1) Interrupt Mask Register
AT91C_TWI1_SR             EQU (0xFFFD8020) ;- (TWI1) Status Register
AT91C_TWI1_IDR            EQU (0xFFFD8028) ;- (TWI1) Interrupt Disable Register
AT91C_TWI1_CR             EQU (0xFFFD8000) ;- (TWI1) Control Register
AT91C_TWI1_SMR            EQU (0xFFFD8008) ;- (TWI1) Slave Mode Register
/* - ========== Register definition for PDC_US0 peripheral ========== */
AT91C_US0_TCR             EQU (0xFFFB010C) ;- (PDC_US0) Transmit Counter Register
AT91C_US0_PTCR            EQU (0xFFFB0120) ;- (PDC_US0) PDC Transfer Control Register
AT91C_US0_RNCR            EQU (0xFFFB0114) ;- (PDC_US0) Receive Next Counter Register
AT91C_US0_PTSR            EQU (0xFFFB0124) ;- (PDC_US0) PDC Transfer Status Register
AT91C_US0_TNCR            EQU (0xFFFB011C) ;- (PDC_US0) Transmit Next Counter Register
AT91C_US0_RNPR            EQU (0xFFFB0110) ;- (PDC_US0) Receive Next Pointer Register
AT91C_US0_RCR             EQU (0xFFFB0104) ;- (PDC_US0) Receive Counter Register
AT91C_US0_TPR             EQU (0xFFFB0108) ;- (PDC_US0) Transmit Pointer Register
AT91C_US0_TNPR            EQU (0xFFFB0118) ;- (PDC_US0) Transmit Next Pointer Register
AT91C_US0_RPR             EQU (0xFFFB0100) ;- (PDC_US0) Receive Pointer Register
/* - ========== Register definition for US0 peripheral ========== */
AT91C_US0_RHR             EQU (0xFFFB0018) ;- (US0) Receiver Holding Register
AT91C_US0_NER             EQU (0xFFFB0044) ;- (US0) Nb Errors Register
AT91C_US0_IER             EQU (0xFFFB0008) ;- (US0) Interrupt Enable Register
AT91C_US0_CR              EQU (0xFFFB0000) ;- (US0) Control Register
AT91C_US0_THR             EQU (0xFFFB001C) ;- (US0) Transmitter Holding Register
AT91C_US0_CSR             EQU (0xFFFB0014) ;- (US0) Channel Status Register
AT91C_US0_BRGR            EQU (0xFFFB0020) ;- (US0) Baud Rate Generator Register
AT91C_US0_RTOR            EQU (0xFFFB0024) ;- (US0) Receiver Time-out Register
AT91C_US0_TTGR            EQU (0xFFFB0028) ;- (US0) Transmitter Time-guard Register
AT91C_US0_IDR             EQU (0xFFFB000C) ;- (US0) Interrupt Disable Register
AT91C_US0_MR              EQU (0xFFFB0004) ;- (US0) Mode Register
AT91C_US0_IF              EQU (0xFFFB004C) ;- (US0) IRDA_FILTER Register
AT91C_US0_FIDI            EQU (0xFFFB0040) ;- (US0) FI_DI_Ratio Register
AT91C_US0_IMR             EQU (0xFFFB0010) ;- (US0) Interrupt Mask Register
/* - ========== Register definition for PDC_US1 peripheral ========== */
AT91C_US1_PTCR            EQU (0xFFFB4120) ;- (PDC_US1) PDC Transfer Control Register
AT91C_US1_RCR             EQU (0xFFFB4104) ;- (PDC_US1) Receive Counter Register
AT91C_US1_RPR             EQU (0xFFFB4100) ;- (PDC_US1) Receive Pointer Register
AT91C_US1_PTSR            EQU (0xFFFB4124) ;- (PDC_US1) PDC Transfer Status Register
AT91C_US1_TPR             EQU (0xFFFB4108) ;- (PDC_US1) Transmit Pointer Register
AT91C_US1_TCR             EQU (0xFFFB410C) ;- (PDC_US1) Transmit Counter Register
AT91C_US1_RNPR            EQU (0xFFFB4110) ;- (PDC_US1) Receive Next Pointer Register
AT91C_US1_TNCR            EQU (0xFFFB411C) ;- (PDC_US1) Transmit Next Counter Register
AT91C_US1_RNCR            EQU (0xFFFB4114) ;- (PDC_US1) Receive Next Counter Register
AT91C_US1_TNPR            EQU (0xFFFB4118) ;- (PDC_US1) Transmit Next Pointer Register
/* - ========== Register definition for US1 peripheral ========== */
AT91C_US1_THR             EQU (0xFFFB401C) ;- (US1) Transmitter Holding Register
AT91C_US1_TTGR            EQU (0xFFFB4028) ;- (US1) Transmitter Time-guard Register
AT91C_US1_BRGR            EQU (0xFFFB4020) ;- (US1) Baud Rate Generator Register
AT91C_US1_IDR             EQU (0xFFFB400C) ;- (US1) Interrupt Disable Register
AT91C_US1_MR              EQU (0xFFFB4004) ;- (US1) Mode Register
AT91C_US1_RTOR            EQU (0xFFFB4024) ;- (US1) Receiver Time-out Register
AT91C_US1_CR              EQU (0xFFFB4000) ;- (US1) Control Register
AT91C_US1_IMR             EQU (0xFFFB4010) ;- (US1) Interrupt Mask Register
AT91C_US1_FIDI            EQU (0xFFFB4040) ;- (US1) FI_DI_Ratio Register
AT91C_US1_RHR             EQU (0xFFFB4018) ;- (US1) Receiver Holding Register
AT91C_US1_IER             EQU (0xFFFB4008) ;- (US1) Interrupt Enable Register
AT91C_US1_CSR             EQU (0xFFFB4014) ;- (US1) Channel Status Register
AT91C_US1_IF              EQU (0xFFFB404C) ;- (US1) IRDA_FILTER Register
AT91C_US1_NER             EQU (0xFFFB4044) ;- (US1) Nb Errors Register
/* - ========== Register definition for PDC_US2 peripheral ========== */
AT91C_US2_TNCR            EQU (0xFFFB811C) ;- (PDC_US2) Transmit Next Counter Register
AT91C_US2_RNCR            EQU (0xFFFB8114) ;- (PDC_US2) Receive Next Counter Register
AT91C_US2_TNPR            EQU (0xFFFB8118) ;- (PDC_US2) Transmit Next Pointer Register
AT91C_US2_PTCR            EQU (0xFFFB8120) ;- (PDC_US2) PDC Transfer Control Register
AT91C_US2_TCR             EQU (0xFFFB810C) ;- (PDC_US2) Transmit Counter Register
AT91C_US2_RPR             EQU (0xFFFB8100) ;- (PDC_US2) Receive Pointer Register
AT91C_US2_TPR             EQU (0xFFFB8108) ;- (PDC_US2) Transmit Pointer Register
AT91C_US2_RCR             EQU (0xFFFB8104) ;- (PDC_US2) Receive Counter Register
AT91C_US2_PTSR            EQU (0xFFFB8124) ;- (PDC_US2) PDC Transfer Status Register
AT91C_US2_RNPR            EQU (0xFFFB8110) ;- (PDC_US2) Receive Next Pointer Register
/* - ========== Register definition for US2 peripheral ========== */
AT91C_US2_RTOR            EQU (0xFFFB8024) ;- (US2) Receiver Time-out Register
AT91C_US2_CSR             EQU (0xFFFB8014) ;- (US2) Channel Status Register
AT91C_US2_CR              EQU (0xFFFB8000) ;- (US2) Control Register
AT91C_US2_BRGR            EQU (0xFFFB8020) ;- (US2) Baud Rate Generator Register
AT91C_US2_NER             EQU (0xFFFB8044) ;- (US2) Nb Errors Register
AT91C_US2_FIDI            EQU (0xFFFB8040) ;- (US2) FI_DI_Ratio Register
AT91C_US2_TTGR            EQU (0xFFFB8028) ;- (US2) Transmitter Time-guard Register
AT91C_US2_RHR             EQU (0xFFFB8018) ;- (US2) Receiver Holding Register
AT91C_US2_IDR             EQU (0xFFFB800C) ;- (US2) Interrupt Disable Register
AT91C_US2_THR             EQU (0xFFFB801C) ;- (US2) Transmitter Holding Register
AT91C_US2_MR              EQU (0xFFFB8004) ;- (US2) Mode Register
AT91C_US2_IMR             EQU (0xFFFB8010) ;- (US2) Interrupt Mask Register
AT91C_US2_IF              EQU (0xFFFB804C) ;- (US2) IRDA_FILTER Register
AT91C_US2_IER             EQU (0xFFFB8008) ;- (US2) Interrupt Enable Register
/* - ========== Register definition for PDC_US3 peripheral ========== */
AT91C_US3_RNPR            EQU (0xFFFD0110) ;- (PDC_US3) Receive Next Pointer Register
AT91C_US3_RNCR            EQU (0xFFFD0114) ;- (PDC_US3) Receive Next Counter Register
AT91C_US3_PTSR            EQU (0xFFFD0124) ;- (PDC_US3) PDC Transfer Status Register
AT91C_US3_PTCR            EQU (0xFFFD0120) ;- (PDC_US3) PDC Transfer Control Register
AT91C_US3_TCR             EQU (0xFFFD010C) ;- (PDC_US3) Transmit Counter Register
AT91C_US3_TNPR            EQU (0xFFFD0118) ;- (PDC_US3) Transmit Next Pointer Register
AT91C_US3_RCR             EQU (0xFFFD0104) ;- (PDC_US3) Receive Counter Register
AT91C_US3_TPR             EQU (0xFFFD0108) ;- (PDC_US3) Transmit Pointer Register
AT91C_US3_TNCR            EQU (0xFFFD011C) ;- (PDC_US3) Transmit Next Counter Register
AT91C_US3_RPR             EQU (0xFFFD0100) ;- (PDC_US3) Receive Pointer Register
/* - ========== Register definition for US3 peripheral ========== */
AT91C_US3_NER             EQU (0xFFFD0044) ;- (US3) Nb Errors Register
AT91C_US3_RTOR            EQU (0xFFFD0024) ;- (US3) Receiver Time-out Register
AT91C_US3_IDR             EQU (0xFFFD000C) ;- (US3) Interrupt Disable Register
AT91C_US3_MR              EQU (0xFFFD0004) ;- (US3) Mode Register
AT91C_US3_FIDI            EQU (0xFFFD0040) ;- (US3) FI_DI_Ratio Register
AT91C_US3_BRGR            EQU (0xFFFD0020) ;- (US3) Baud Rate Generator Register
AT91C_US3_THR             EQU (0xFFFD001C) ;- (US3) Transmitter Holding Register
AT91C_US3_CR              EQU (0xFFFD0000) ;- (US3) Control Register
AT91C_US3_IF              EQU (0xFFFD004C) ;- (US3) IRDA_FILTER Register
AT91C_US3_IER             EQU (0xFFFD0008) ;- (US3) Interrupt Enable Register
AT91C_US3_TTGR            EQU (0xFFFD0028) ;- (US3) Transmitter Time-guard Register
AT91C_US3_RHR             EQU (0xFFFD0018) ;- (US3) Receiver Holding Register
AT91C_US3_IMR             EQU (0xFFFD0010) ;- (US3) Interrupt Mask Register
AT91C_US3_CSR             EQU (0xFFFD0014) ;- (US3) Channel Status Register
/* - ========== Register definition for PDC_US4 peripheral ========== */
AT91C_US4_TNCR            EQU (0xFFFD411C) ;- (PDC_US4) Transmit Next Counter Register
AT91C_US4_RPR             EQU (0xFFFD4100) ;- (PDC_US4) Receive Pointer Register
AT91C_US4_RNCR            EQU (0xFFFD4114) ;- (PDC_US4) Receive Next Counter Register
AT91C_US4_TPR             EQU (0xFFFD4108) ;- (PDC_US4) Transmit Pointer Register
AT91C_US4_PTCR            EQU (0xFFFD4120) ;- (PDC_US4) PDC Transfer Control Register
AT91C_US4_TCR             EQU (0xFFFD410C) ;- (PDC_US4) Transmit Counter Register
AT91C_US4_RCR             EQU (0xFFFD4104) ;- (PDC_US4) Receive Counter Register
AT91C_US4_RNPR            EQU (0xFFFD4110) ;- (PDC_US4) Receive Next Pointer Register
AT91C_US4_TNPR            EQU (0xFFFD4118) ;- (PDC_US4) Transmit Next Pointer Register
AT91C_US4_PTSR            EQU (0xFFFD4124) ;- (PDC_US4) PDC Transfer Status Register
/* - ========== Register definition for US4 peripheral ========== */
AT91C_US4_BRGR            EQU (0xFFFD4020) ;- (US4) Baud Rate Generator Register
AT91C_US4_THR             EQU (0xFFFD401C) ;- (US4) Transmitter Holding Register
AT91C_US4_RTOR            EQU (0xFFFD4024) ;- (US4) Receiver Time-out Register
AT91C_US4_IMR             EQU (0xFFFD4010) ;- (US4) Interrupt Mask Register
AT91C_US4_NER             EQU (0xFFFD4044) ;- (US4) Nb Errors Register
AT91C_US4_TTGR            EQU (0xFFFD4028) ;- (US4) Transmitter Time-guard Register
AT91C_US4_FIDI            EQU (0xFFFD4040) ;- (US4) FI_DI_Ratio Register
AT91C_US4_MR              EQU (0xFFFD4004) ;- (US4) Mode Register
AT91C_US4_IER             EQU (0xFFFD4008) ;- (US4) Interrupt Enable Register
AT91C_US4_RHR             EQU (0xFFFD4018) ;- (US4) Receiver Holding Register
AT91C_US4_CR              EQU (0xFFFD4000) ;- (US4) Control Register
AT91C_US4_IF              EQU (0xFFFD404C) ;- (US4) IRDA_FILTER Register
AT91C_US4_IDR             EQU (0xFFFD400C) ;- (US4) Interrupt Disable Register
AT91C_US4_CSR             EQU (0xFFFD4014) ;- (US4) Channel Status Register
/* - ========== Register definition for PDC_SSC0 peripheral ========== */
AT91C_SSC0_TNPR           EQU (0xFFFBC118) ;- (PDC_SSC0) Transmit Next Pointer Register
AT91C_SSC0_TCR            EQU (0xFFFBC10C) ;- (PDC_SSC0) Transmit Counter Register
AT91C_SSC0_RNCR           EQU (0xFFFBC114) ;- (PDC_SSC0) Receive Next Counter Register
AT91C_SSC0_RPR            EQU (0xFFFBC100) ;- (PDC_SSC0) Receive Pointer Register
AT91C_SSC0_TPR            EQU (0xFFFBC108) ;- (PDC_SSC0) Transmit Pointer Register
AT91C_SSC0_RCR            EQU (0xFFFBC104) ;- (PDC_SSC0) Receive Counter Register
AT91C_SSC0_RNPR           EQU (0xFFFBC110) ;- (PDC_SSC0) Receive Next Pointer Register
AT91C_SSC0_PTCR           EQU (0xFFFBC120) ;- (PDC_SSC0) PDC Transfer Control Register
AT91C_SSC0_TNCR           EQU (0xFFFBC11C) ;- (PDC_SSC0) Transmit Next Counter Register
AT91C_SSC0_PTSR           EQU (0xFFFBC124) ;- (PDC_SSC0) PDC Transfer Status Register
/* - ========== Register definition for SSC0 peripheral ========== */
AT91C_SSC0_IMR            EQU (0xFFFBC04C) ;- (SSC0) Interrupt Mask Register
AT91C_SSC0_RFMR           EQU (0xFFFBC014) ;- (SSC0) Receive Frame Mode Register
AT91C_SSC0_CR             EQU (0xFFFBC000) ;- (SSC0) Control Register
AT91C_SSC0_TFMR           EQU (0xFFFBC01C) ;- (SSC0) Transmit Frame Mode Register
AT91C_SSC0_CMR            EQU (0xFFFBC004) ;- (SSC0) Clock Mode Register
AT91C_SSC0_IER            EQU (0xFFFBC044) ;- (SSC0) Interrupt Enable Register
AT91C_SSC0_RHR            EQU (0xFFFBC020) ;- (SSC0) Receive Holding Register
AT91C_SSC0_RCMR           EQU (0xFFFBC010) ;- (SSC0) Receive Clock ModeRegister
AT91C_SSC0_SR             EQU (0xFFFBC040) ;- (SSC0) Status Register
AT91C_SSC0_RSHR           EQU (0xFFFBC030) ;- (SSC0) Receive Sync Holding Register
AT91C_SSC0_THR            EQU (0xFFFBC024) ;- (SSC0) Transmit Holding Register
AT91C_SSC0_TCMR           EQU (0xFFFBC018) ;- (SSC0) Transmit Clock Mode Register
AT91C_SSC0_IDR            EQU (0xFFFBC048) ;- (SSC0) Interrupt Disable Register
AT91C_SSC0_TSHR           EQU (0xFFFBC034) ;- (SSC0) Transmit Sync Holding Register
/* - ========== Register definition for PDC_SPI0 peripheral ========== */
AT91C_SPI0_PTCR           EQU (0xFFFC8120) ;- (PDC_SPI0) PDC Transfer Control Register
AT91C_SPI0_TCR            EQU (0xFFFC810C) ;- (PDC_SPI0) Transmit Counter Register
AT91C_SPI0_RPR            EQU (0xFFFC8100) ;- (PDC_SPI0) Receive Pointer Register
AT91C_SPI0_TPR            EQU (0xFFFC8108) ;- (PDC_SPI0) Transmit Pointer Register
AT91C_SPI0_PTSR           EQU (0xFFFC8124) ;- (PDC_SPI0) PDC Transfer Status Register
AT91C_SPI0_RNCR           EQU (0xFFFC8114) ;- (PDC_SPI0) Receive Next Counter Register
AT91C_SPI0_TNPR           EQU (0xFFFC8118) ;- (PDC_SPI0) Transmit Next Pointer Register
AT91C_SPI0_RCR            EQU (0xFFFC8104) ;- (PDC_SPI0) Receive Counter Register
AT91C_SPI0_RNPR           EQU (0xFFFC8110) ;- (PDC_SPI0) Receive Next Pointer Register
AT91C_SPI0_TNCR           EQU (0xFFFC811C) ;- (PDC_SPI0) Transmit Next Counter Register
/* - ========== Register definition for SPI0 peripheral ========== */
AT91C_SPI0_IDR            EQU (0xFFFC8018) ;- (SPI0) Interrupt Disable Register
AT91C_SPI0_TDR            EQU (0xFFFC800C) ;- (SPI0) Transmit Data Register
AT91C_SPI0_SR             EQU (0xFFFC8010) ;- (SPI0) Status Register
AT91C_SPI0_CR             EQU (0xFFFC8000) ;- (SPI0) Control Register
AT91C_SPI0_CSR            EQU (0xFFFC8030) ;- (SPI0) Chip Select Register
AT91C_SPI0_RDR            EQU (0xFFFC8008) ;- (SPI0) Receive Data Register
AT91C_SPI0_MR             EQU (0xFFFC8004) ;- (SPI0) Mode Register
AT91C_SPI0_IER            EQU (0xFFFC8014) ;- (SPI0) Interrupt Enable Register
AT91C_SPI0_IMR            EQU (0xFFFC801C) ;- (SPI0) Interrupt Mask Register
/* - ========== Register definition for PDC_SPI1 peripheral ========== */
AT91C_SPI1_PTCR           EQU (0xFFFCC120) ;- (PDC_SPI1) PDC Transfer Control Register
AT91C_SPI1_RNPR           EQU (0xFFFCC110) ;- (PDC_SPI1) Receive Next Pointer Register
AT91C_SPI1_RCR            EQU (0xFFFCC104) ;- (PDC_SPI1) Receive Counter Register
AT91C_SPI1_TPR            EQU (0xFFFCC108) ;- (PDC_SPI1) Transmit Pointer Register
